{"modelTopology": {"model_config": {"config": {"name": "sequential_7", "layers": [{"config": {"filters": 64, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_13", "data_format": "channels_last", "batch_input_shape": [null, 128, 128, 3], "kernel_size": [3, 3], "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_31", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_13", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_13", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 64, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_14", "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_32", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_14", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_14", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 64, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_15", "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_33", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_15", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_15", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 64, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_16", "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_34", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_16", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_16", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"filters": 64, "activation": "linear", "padding": "valid", "dilation_rate": [1, 1], "name": "conv2d_17", "data_format": "channels_last", "kernel_constraint": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "trainable": true}, "class_name": "Conv2D"}, {"config": {"name": "activation_35", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "strides": [2, 2], "name": "max_pooling2d_17", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_17", "rate": 0.2, "noise_shape": null, "trainable": true, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_7", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "bias_constraint": null, "name": "dense_19", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "units": 128}, "class_name": "Dense"}, {"config": {"name": "activation_36", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias_constraint": null, "name": "dense_20", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "units": 70}, "class_name": "Dense"}, {"config": {"name": "activation_37", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias_constraint": null, "name": "dense_21", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "units": 6}, "class_name": "Dense"}, {"config": {"name": "activation_38", "activation": "softmax", "trainable": true}, "class_name": "Activation"}]}, "class_name": "Sequential"}, "keras_version": "2.2.4", "backend": "tensorflow", "training_config": {"loss_weights": null, "optimizer_config": {"config": {"decay": 0.0, "beta_1": 0.8999999761581421, "amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 0.0010000000474974513}, "class_name": "Adam"}, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "sample_weight_mode": null}}, "weightsManifest": [{"weights": [{"name": "conv2d_13/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_14/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_19/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_19/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_20/kernel", "shape": [128, 70], "dtype": "float32"}, {"name": "dense_20/bias", "shape": [70], "dtype": "float32"}, {"name": "dense_21/kernel", "shape": [70, 6], "dtype": "float32"}, {"name": "dense_21/bias", "shape": [6], "dtype": "float32"}], "paths": ["group1-shard1of1"]}]}