{"weightsManifest": [{"weights": [{"dtype": "float32", "shape": [3, 3, 3, 64], "name": "conv2d_13/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_13/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_14/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_14/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_15/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_15/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_16/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_16/bias"}, {"dtype": "float32", "shape": [3, 3, 64, 64], "name": "conv2d_17/kernel"}, {"dtype": "float32", "shape": [64], "name": "conv2d_17/bias"}, {"dtype": "float32", "shape": [256, 128], "name": "dense_19/kernel"}, {"dtype": "float32", "shape": [128], "name": "dense_19/bias"}, {"dtype": "float32", "shape": [128, 70], "name": "dense_20/kernel"}, {"dtype": "float32", "shape": [70], "name": "dense_20/bias"}, {"dtype": "float32", "shape": [70, 6], "name": "dense_21/kernel"}, {"dtype": "float32", "shape": [6], "name": "dense_21/bias"}], "paths": ["group1-shard1of1"]}], "modelTopology": {"training_config": {"sample_weight_mode": null, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "lr": 0.0010000000474974513, "amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "beta_1": 0.8999999761581421}}}, "backend": "tensorflow", "keras_version": "2.2.4", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_7", "layers": [{"class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "padding": "valid", "dtype": "float32", "strides": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 128, 128, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "name": "conv2d_13"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_31", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_13"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_13", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "name": "conv2d_14"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_32", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_14"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_14", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "name": "conv2d_15"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_33", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_15"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_15", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "name": "conv2d_16"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_34", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_16"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_16", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "name": "conv2d_17"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_35", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_17"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_17", "trainable": true}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_7", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 128, "name": "dense_19"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_36", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 70, "name": "dense_20"}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_37", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "units": 6, "name": "dense_21"}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_38", "trainable": true}}]}}}}